In [1]:
import pandas as pd

In [2]:
ls

anaconda3/    Downloads/          Main-Projects/     nltk_data/     snap/
assgn1.ipynb  eclipse/            mongo_backup_3_6/  Pictures/      Templates/
Desktop/      eclipse-workspace/  mongodb-crud-app/  Public/        Videos/
Documents/    examples.desktop    Music/             seaborn-data/

In [8]:

import os
os.getcwd()

'/home/csl-4'

In [9]:
os.listdir()

['Music',
 '.gnupg',
 '.eclipse',
 '.config',
 '.nvm',
 'assgn1.ipynb',
 '.vscode',
 'examples.desktop',
 'mongo_backup_3_6',
 '.local',
 'seaborn-data',
 'Public',
 '.bash_history',
 '.ICEauthority',
 'Videos',
 '.mongodb',
 '.p2',
 '.swt',
 '.gphoto',
 '.pki',
 'archive.zip',
 '.bashrc',
 '.viminfo',
 'Pictures',
 '.dotnet',
 '.gvfs',
 '.condarc',
 '.cache',
 'eclipse',
 '.mozilla',
 'eclipse-workspace',
 '.thunderbird',
 '.sudo_as_admin_successful',
 '.conda',
 'anaconda3',
 '.ipynb_checkpoints',
 '.pam_environment',
 '.ssh',
 'Templates',
 'Main-Projects',
 'Downloads',
 'Desktop',
 '.anaconda',
 '.mongorc.js',
 '.dbus',
 '.keras',
 '.gnome',
 'nltk_data',
 'Documents',
 '.jupyter',
 'snap',
 '.npm',
 'mongodb-crud-app',
 '.python_history',
 '.dbshell',
 '.ipython',
 '.continuum']

### Method 1: Dataset Loaded from Kaggle (ZIP Download)
The dataset was downloaded from Kaggle in ZIP format, extracted, and loaded using Pandas.

In [11]:
import pandas as pd

df_kaggle = pd.read_csv("/home/csl-4/archive.csv")
 
df_kaggle.head()

,id,title,original_language,release_date,vote_average,vote_count,popularity,overview,genre_ids,Genres
0,278,The Shawshank Redemption,en,1994-09-23,8.706,26840,150.307,Imprisoned in the 1940s for the double murder ...,"[18, 80]","['Drama', 'Crime']"
1,238,The Godfather,en,1972-03-14,8.690,20373,122.973,"Spanning the years 1945 to 1955, a chronicle o...","[18, 80]","['Drama', 'Crime']"
2,240,The Godfather Part II,en,1974-12-20,8.575,12291,94.204,In the continuing saga of the Corleone crime f...,"[18, 80]","['Drama', 'Crime']"
3,424,Schindler's List,en,1993-12-15,8.565,15695,74.615,The true story of how businessman Oskar Schind...,"[18, 36, 10752]","['Drama', 'History', 'War']"
4,389,12 Angry Men,en,1957-04-10,8.546,8522,54.678,The defense and the prosecution have rested an...,[18],['Drama']

### Method 2: Dataset Loaded Directly Using URL

In this method, a dataset was imported directly into the Jupyter Notebook from an online source using its URL and the Pandas library.

In [12]:
import pandas as pd

url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv"

df_url = pd.read_csv(url)
df_url.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [13]:
df_url.shape
df_url.columns
df_url.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### Method 3: Manually Created Dataset

In this method, a custom dataset was created manually using Python data structures and converted into a Pandas DataFrame.

In [14]:
import pandas as pd

data = {
    "Student_ID": [1, 2, 3, 4, 5],
    "Name": ["Amit", "Riya", "Suresh", "Neha", "Rahul"],
    "Marks": [78, 85, 69, 90, 72],
    "Attendance": [92, 88, 75, 95, 80]
}

df_custom = pd.DataFrame(data)
df_custom

   Student_ID    Name  Marks  Attendance
0           1    Amit     78          92
1           2    Riya     85          88
2           3  Suresh     69          75
3           4    Neha     90          95
4           5   Rahul     72          80

In [15]:
df_custom.shape
df_custom.describe()

       Student_ID      Marks  Attendance
count    5.000000   5.000000    5.000000
mean     3.000000  78.800000   86.000000
std      1.581139   8.757854    8.336666
min      1.000000  69.000000   75.000000
25%      2.000000  72.000000   80.000000
50%      3.000000  78.000000   88.000000
75%      4.000000  85.000000   92.000000
max      5.000000  90.000000   95.000000

In [16]:
df_custom.to_csv("student_data.csv", index=False)

### method 4 - using mysql

In [18]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="dsbda_user",
    password="dsbda123",
    database="dsbda"
)

df_mysql = pd.read_sql("SELECT * FROM employees", conn)
df_mysql

   emp_id   name department  salary
0       1   Aman         IT   60000
1       2  Pooja         HR   45000
2       3   Ravi    Finance   50000
3       4   Neha         IT   65000

# data wrangling

In [3]:
import pandas as pd

data = pd.read_csv("/home/csl-4/7326/archive.csv")

In [4]:
data.head()

,id,title,original_language,release_date,vote_average,vote_count,popularity,overview,genre_ids,Genres
0,278,The Shawshank Redemption,en,1994-09-23,8.706,26840,150.307,Imprisoned in the 1940s for the double murder ...,"[18, 80]","['Drama', 'Crime']"
1,238,The Godfather,en,1972-03-14,8.690,20373,122.973,"Spanning the years 1945 to 1955, a chronicle o...","[18, 80]","['Drama', 'Crime']"
2,240,The Godfather Part II,en,1974-12-20,8.575,12291,94.204,In the continuing saga of the Corleone crime f...,"[18, 80]","['Drama', 'Crime']"
3,424,Schindler's List,en,1993-12-15,8.565,15695,74.615,The true story of how businessman Oskar Schind...,"[18, 36, 10752]","['Drama', 'History', 'War']"
4,389,12 Angry Men,en,1957-04-10,8.546,8522,54.678,The defense and the prosecution have rested an...,[18],['Drama']

In [5]:
print(data.shape)

(9630, 10)

In [6]:
data.describe()

                 id  vote_average    vote_count   popularity
count  9.630000e+03   9630.000000   9630.000000  9630.000000
mean   1.944046e+05      6.633820   1976.992004    25.522728
std    2.576246e+05      0.783581   3124.089193    58.278888
min    2.000000e+00      2.200000    300.000000     0.018000
25%    1.013825e+04      6.106000    468.000000    10.780250
50%    3.748350e+04      6.659000    843.000000    15.620000
75%    3.524915e+05      7.200000   1964.750000    25.325000
max    1.226578e+06      8.706000  36306.000000  2811.772000

In [7]:
data.dtypes

id                     int64
title                 object
original_language     object
release_date          object
vote_average         float64
vote_count             int64
popularity           float64
overview              object
genre_ids             object
Genres                object
dtype: object

In [8]:
data["id"].dtype

dtype('int64')

In [9]:
data["title"].dtype

dtype('O')

In [10]:
data["Genres"].dtype

dtype('O')

In [11]:
data["popularity"].dtype

dtype('float64')

In [12]:
data["id"].dropna()

0         278
1         238
2         240
3         424
4         389
        ...
9625    12142
9626    13805
9627    11059
9628    14164
9629    40016
Name: id, Length: 9630, dtype: int64

In [14]:
data["id"]=data["id"].astype("Float64")

In [16]:
data.dtypes

id                   Float64
title                 object
original_language     object
release_date          object
vote_average         float64
vote_count             int64
popularity           float64
overview              object
genre_ids             object
Genres                object
dtype: object

In [17]:
data["id"]=data["id"].astype("Int64")

In [18]:
data["id"].dtypes

Int64Dtype()

In [19]:
data.head(10)

,id,title,original_language,release_date,vote_average,vote_count,popularity,overview,genre_ids,Genres
0,278,The Shawshank Redemption,en,1994-09-23,8.706,26840,150.307,Imprisoned in the 1940s for the double murder ...,"[18, 80]","['Drama', 'Crime']"
1,238,The Godfather,en,1972-03-14,8.690,20373,122.973,"Spanning the years 1945 to 1955, a chronicle o...","[18, 80]","['Drama', 'Crime']"
2,240,The Godfather Part II,en,1974-12-20,8.575,12291,94.204,In the continuing saga of the Corleone crime f...,"[18, 80]","['Drama', 'Crime']"
3,424,Schindler's List,en,1993-12-15,8.565,15695,74.615,The true story of how businessman Oskar Schind...,"[18, 36, 10752]","['Drama', 'History', 'War']"
4,389,12 Angry Men,en,1957-04-10,8.546,8522,54.678,The defense and the prosecution have rested an...,[18],['Drama']
5,129,Spirited Away,ja,2001-07-20,8.537,16339,108.463,"A young girl, Chihiro, becomes trapped in a st...","[16, 10751, 14]","['Animation', 'Family', 'Fantasy']"
6,19404,Dilwale Dulhania Le Jayenge,hi,1995-10-20,8.500,4424,50.725,"Raj is a rich, carefree, happy-go-lucky second...","[35, 18, 10749]","['Comedy', 'Drama', 'Romance']"
7,155,The Dark Knight,en,2008-07-16,8.516,32576,148.284,Batman raises the stakes in his war on crime. ...,"[18, 28, 80, 53]","['Drama', 'Action', 'Crime', 'Thriller']"
8,496243,Parasite,ko,2019-05-30,8.507,18044,90.099,"All unemployed, Ki-taek's family takes peculia...","[35, 53, 18]","['Comedy', 'Thriller', 'Drama']"
9,497,The Green Mile,en,1999-12-10,8.507,17230,81.357,A supernatural tale set on death row in a Sout...,"[14, 18, 80]","['Fantasy', 'Drama', 'Crime']"

In [21]:
import numpy as np
data = data.replace("?", np.NaN)

In [23]:
data.isnull().sum()

id                   0
title                0
original_language    0
release_date         0
vote_average         0
vote_count           0
popularity           0
overview             0
genre_ids            0
Genres               0
dtype: int64

In [24]:
data.tail(10)

,id,title,original_language,release_date,vote_average,vote_count,popularity,overview,genre_ids,Genres
9620,485774,The Open House,en,2018-01-19,3.701,1338,7.923,A teenager and his mother find themselves besi...,"[27, 53]","['Horror', 'Thriller']"
9621,10870,Lucky Luke and the Daltons,fr,2004-11-08,3.680,337,9.716,Joe and Averell are the eldest and youngest of...,"[35, 37, 12]","['Comedy', 'Western', 'Adventure']"
9622,70584,Hellraiser: Revelations,en,2011-10-18,3.600,306,12.042,Two friends in Mexico discover the Lament Conf...,[27],['Horror']
9623,74849,The Star Wars Holiday Special,en,1978-11-17,3.300,450,10.430,Luke Skywalker and Han Solo battle evil Imperi...,"[14, 878, 10751, 10770]","['Fantasy', 'Science Fiction', 'Family', 'TV M..."
9624,5491,Battlefield Earth,en,2000-05-12,3.300,833,9.594,"In the year 3000, man is no match for the Psyc...","[878, 28, 12]","['Science Fiction', 'Action', 'Adventure']"
9625,12142,Alone in the Dark,en,2005-01-28,3.251,599,11.337,Edward Carnby is a private investigator specia...,"[28, 14, 27]","['Action', 'Fantasy', 'Horror']"
9626,13805,Disaster Movie,en,2008-08-29,3.179,1015,19.006,"Over the course of one evening, an unsuspectin...",[35],['Comedy']
9627,11059,House of the Dead,en,2003-04-11,3.129,379,12.745,"Set on an island off the coast, a techno rave ...","[27, 28, 53]","['Horror', 'Action', 'Thriller']"
9628,14164,Dragonball Evolution,en,2009-03-12,2.896,2016,20.904,"On his 18th birthday, Goku receives a mystical...","[28, 12, 14, 878, 53]","['Action', 'Adventure', 'Fantasy', 'Science Fi..."
9629,40016,Birdemic: Shock and Terror,en,2010-02-27,2.200,331,6.548,A platoon of eagles and vultures attacks the r...,"[10749, 27, 53]","['Romance', 'Horror', 'Thriller']"

In [25]:
data.isnull().any().any()

False

In [26]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")

In [27]:
csv_data.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [28]:
csv_data.isnull().any().any()

False

In [29]:
print(csv_data.columns)

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [30]:
csv_data.dtypes

CustomerID                 int64
Genre                     object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [31]:
csv_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [33]:
csv_data.values

array([[1, 'Male', 19, 15, 39],
       [2, 'Male', 21, 15, 81],
       [3, 'Female', 20, 16, 6],
       [4, 'Female', 23, 16, 77],
       [5, 'Female', 31, 17, 40],
       [6, 'Female', 22, 17, 76],
       [7, 'Female', 35, 18, 6],
       [8, 'Female', 23, 18, 94],
       [9, 'Male', 64, 19, 3],
       [10, 'Female', 30, 19, 72],
       [11, 'Male', 67, 19, 14],
       [12, 'Female', 35, 19, 99],
       [13, 'Female', 58, 20, 15],
       [14, 'Female', 24, 20, 77],
       [15, 'Male', 37, 20, 13],
       [16, 'Male', 22, 20, 79],
       [17, 'Female', 35, 21, 35],
       [18, 'Male', 20, 21, 66],
       [19, 'Male', 52, 23, 29],
       [20, 'Female', 35, 23, 98],
       [21, 'Male', 35, 24, 35],
       [22, 'Male', 25, 24, 73],
       [23, 'Female', 46, 25, 5],
       [24, 'Male', 31, 25, 73],
       [25, 'Female', 54, 28, 14],
       [26, 'Male', 29, 28, 82],
       [27, 'Female', 45, 28, 32],
       [28, 'Male', 35, 28, 61],
       [29, 'Female', 40, 29, 31],
       [30, 'Female', 23, 29, 87],
       [31, 'Male', 60, 30, 4],
       [32, 'Female', 21, 30, 73],
       [33, 'Male', 53, 33, 4],
       [34, 'Male', 18, 33, 92],
       [35, 'Female', 49, 33, 14],
       [36, 'Female', 21, 33, 81],
       [37, 'Female', 42, 34, 17],
       [38, 'Female', 30, 34, 73],
       [39, 'Female', 36, 37, 26],
       [40, 'Female', 20, 37, 75],
       [41, 'Female', 65, 38, 35],
       [42, 'Male', 24, 38, 92],
       [43, 'Male', 48, 39, 36],
       [44, 'Female', 31, 39, 61],
       [45, 'Female', 49, 39, 28],
       [46, 'Female', 24, 39, 65],
       [47, 'Female', 50, 40, 55],
       [48, 'Female', 27, 40, 47],
       [49, 'Female', 29, 40, 42],
       [50, 'Female', 31, 40, 42],
       [51, 'Female', 49, 42, 52],
       [52, 'Male', 33, 42, 60],
       [53, 'Female', 31, 43, 54],
       [54, 'Male', 59, 43, 60],
       [55, 'Female', 50, 43, 45],
       [56, 'Male', 47, 43, 41],
       [57, 'Female', 51, 44, 50],
       [58, 'Male', 69, 44, 46],
       [59, 'Female', 27, 46, 51],
       [60, 'Male', 53, 46, 46],
       [61, 'Male', 70, 46, 56],
       [62, 'Male', 19, 46, 55],
       [63, 'Female', 67, 47, 52],
       [64, 'Female', 54, 47, 59],
       [65, 'Male', 63, 48, 51],
       [66, 'Male', 18, 48, 59],
       [67, 'Female', 43, 48, 50],
       [68, 'Female', 68, 48, 48],
       [69, 'Male', 19, 48, 59],
       [70, 'Female', 32, 48, 47],
       [71, 'Male', 70, 49, 55],
       [72, 'Female', 47, 49, 42],
       [73, 'Female', 60, 50, 49],
       [74, 'Female', 60, 50, 56],
       [75, 'Male', 59, 54, 47],
       [76, 'Male', 26, 54, 54],
       [77, 'Female', 45, 54, 53],
       [78, 'Male', 40, 54, 48],
       [79, 'Female', 23, 54, 52],
       [80, 'Female', 49, 54, 42],
       [81, 'Male', 57, 54, 51],
       [82, 'Male', 38, 54, 55],
       [83, 'Male', 67, 54, 41],
       [84, 'Female', 46, 54, 44],
       [85, 'Female', 21, 54, 57],
       [86, 'Male', 48, 54, 46],
       [87, 'Female', 55, 57, 58],
       [88, 'Female', 22, 57, 55],
       [89, 'Female', 34, 58, 60],
       [90, 'Female', 50, 58, 46],
       [91, 'Female', 68, 59, 55],
       [92, 'Male', 18, 59, 41],
       [93, 'Male', 48, 60, 49],
       [94, 'Female', 40, 60, 40],
       [95, 'Female', 32, 60, 42],
       [96, 'Male', 24, 60, 52],
       [97, 'Female', 47, 60, 47],
       [98, 'Female', 27, 60, 50],
       [99, 'Male', 48, 61, 42],
       [100, 'Male', 20, 61, 49],
       [101, 'Female', 23, 62, 41],
       [102, 'Female', 49, 62, 48],
       [103, 'Male', 67, 62, 59],
       [104, 'Male', 26, 62, 55],
       [105, 'Male', 49, 62, 56],
       [106, 'Female', 21, 62, 42],
       [107, 'Female', 66, 63, 50],
       [108, 'Male', 54, 63, 46],
       [109, 'Male', 68, 63, 43],
       [110, 'Male', 66, 63, 48],
       [111, 'Male', 65, 63, 52],
       [112, 'Female', 19, 63, 54],
       [113, 'Female', 38, 64, 42],
       [114, 'Male', 19, 64, 46],
       [115, 'Female', 18, 65, 48],
       [116, 'Female', 19, 65, 50],
       [117, 'Female', 63, 65, 43],
       [118, 'Female', 49, 65, 59],
       [119, 'Female', 51, 67, 43],
       [120, 'Female', 50, 67, 57],
       [121, 'Male', 27, 67, 56],
       [122, 'Female', 38, 67, 40],
       [123, 'Female', 40, 69, 58],
       [124, 'Male', 39, 69, 91],
       [125, 'Female', 23, 70, 29],
       [126, 'Female', 31, 70, 77],
       [127, 'Male', 43, 71, 35],
       [128, 'Male', 40, 71, 95],
       [129, 'Male', 59, 71, 11],
       [130, 'Male', 38, 71, 75],
       [131, 'Male', 47, 71, 9],
       [132, 'Male', 39, 71, 75],
       [133, 'Female', 25, 72, 34],
       [134, 'Female', 31, 72, 71],
       [135, 'Male', 20, 73, 5],
       [136, 'Female', 29, 73, 88],
       [137, 'Female', 44, 73, 7],
       [138, 'Male', 32, 73, 73],
       [139, 'Male', 19, 74, 10],
       [140, 'Female', 35, 74, 72],
       [141, 'Female', 57, 75, 5],
       [142, 'Male', 32, 75, 93],
       [143, 'Female', 28, 76, 40],
       [144, 'Female', 32, 76, 87],
       [145, 'Male', 25, 77, 12],
       [146, 'Male', 28, 77, 97],
       [147, 'Male', 48, 77, 36],
       [148, 'Female', 32, 77, 74],
       [149, 'Female', 34, 78, 22],
       [150, 'Male', 34, 78, 90],
       [151, 'Male', 43, 78, 17],
       [152, 'Male', 39, 78, 88],
       [153, 'Female', 44, 78, 20],
       [154, 'Female', 38, 78, 76],
       [155, 'Female', 47, 78, 16],
       [156, 'Female', 27, 78, 89],
       [157, 'Male', 37, 78, 1],
       [158, 'Female', 30, 78, 78],
       [159, 'Male', 34, 78, 1],
       [160, 'Female', 30, 78, 73],
       [161, 'Female', 56, 79, 35],
       [162, 'Female', 29, 79, 83],
       [163, 'Male', 19, 81, 5],
       [164, 'Female', 31, 81, 93],
       [165, 'Male', 50, 85, 26],
       [166, 'Female', 36, 85, 75],
       [167, 'Male', 42, 86, 20],
       [168, 'Female', 33, 86, 95],
       [169, 'Female', 36, 87, 27],
       [170, 'Male', 32, 87, 63],
       [171, 'Male', 40, 87, 13],
       [172, 'Male', 28, 87, 75],
       [173, 'Male', 36, 87, 10],
       [174, 'Male', 36, 87, 92],
       [175, 'Female', 52, 88, 13],
       [176, 'Female', 30, 88, 86],
       [177, 'Male', 58, 88, 15],
       [178, 'Male', 27, 88, 69],
       [179, 'Male', 59, 93, 14],
       [180, 'Male', 35, 93, 90],
       [181, 'Female', 37, 97, 32],
       [182, 'Female', 32, 97, 86],
       [183, 'Male', 46, 98, 15],
       [184, 'Female', 29, 98, 88],
       [185, 'Female', 41, 99, 39],
       [186, 'Male', 30, 99, 97],
       [187, 'Female', 54, 101, 24],
       [188, 'Male', 28, 101, 68],
       [189, 'Female', 41, 103, 17],
       [190, 'Female', 36, 103, 85],
       [191, 'Female', 34, 103, 23],
       [192, 'Female', 32, 103, 69],
       [193, 'Male', 33, 113, 8],
       [194, 'Female', 38, 113, 91],
       [195, 'Female', 47, 120, 16],
       [196, 'Female', 35, 120, 79],
       [197, 'Female', 45, 126, 28],
       [198, 'Male', 32, 126, 74],
       [199, 'Male', 32, 137, 18],
       [200, 'Male', 30, 137, 83]], dtype=object)

In [34]:
csv_data.value_counts()

CustomerID  Genre   Age  Annual Income (k$)  Spending Score (1-100)
1           Male    19   15                  39                        1
138         Male    32   73                  73                        1
128         Male    40   71                  95                        1
129         Male    59   71                  11                        1
130         Male    38   71                  75                        1
                                                                      ..
70          Female  32   48                  47                        1
71          Male    70   49                  55                        1
72          Female  47   49                  42                        1
73          Female  60   50                  49                        1
200         Male    30   137                 83                        1
Length: 200, dtype: int64

In [35]:
csv_data.ndim

2

In [36]:
csv_data.size

1000

In [37]:
csv_data.shape

(200, 5)

In [38]:
csv_data.empty

False

In [39]:
print(csv_data["Age"])

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

In [40]:
csv_data.loc[5,'CustomerID']

6

In [41]:
csv_data.loc[5]

CustomerID                     6
Genre                     Female
Age                           22
Annual Income (k$)            17
Spending Score (1-100)        76
Name: 5, dtype: object

In [42]:
print(csv_data.loc[2:5])

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76

In [43]:
print(csv_data.iloc[5])

CustomerID                     6
Genre                     Female
Age                           22
Annual Income (k$)            17
Spending Score (1-100)        76
Name: 5, dtype: object

In [44]:
print(csv_data["Age"].iloc[1])

21

In [45]:
print(csv_data.iloc[5:10])

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

In [46]:
print(csv_data[csv_data.Genre=='Female'])

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
5             6  Female   22                  17                      76
6             7  Female   35                  18                       6
..          ...     ...  ...                 ...                     ...
191         192  Female   32                 103                      69
193         194  Female   38                 113                      91
194         195  Female   47                 120                      16
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28

[112 rows x 5 columns]

In [47]:
print(csv_data[(csv_data.Genre=='Female') & (csv_data.Age>60)])

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
40           41  Female   65                  38                      35
62           63  Female   67                  47                      52
67           68  Female   68                  48                      48
90           91  Female   68                  59                      55
106         107  Female   66                  63                      50
116         117  Female   63                  65                      43

In [48]:
csv_data[csv_data.Genre.str.startswith('M')]

     CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1  Male   19                  15                      39
1             2  Male   21                  15                      81
8             9  Male   64                  19                       3
10           11  Male   67                  19                      14
14           15  Male   37                  20                      13
..          ...   ...  ...                 ...                     ...
187         188  Male   28                 101                      68
192         193  Male   33                 113                       8
197         198  Male   32                 126                      74
198         199  Male   32                 137                      18
199         200  Male   30                 137                      83

[88 rows x 5 columns]

In [49]:
names = ['M','F','Male']
csv_data[csv_data.Genre.isin(names)]

     CustomerID Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1  Male   19                  15                      39
1             2  Male   21                  15                      81
8             9  Male   64                  19                       3
10           11  Male   67                  19                      14
14           15  Male   37                  20                      13
..          ...   ...  ...                 ...                     ...
187         188  Male   28                 101                      68
192         193  Male   33                 113                       8
197         198  Male   32                 126                      74
198         199  Male   32                 137                      18
199         200  Male   30                 137                      83

[88 rows x 5 columns]

In [50]:
csv_data.query('Genre == "Female" and Age > 60')

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
40           41  Female   65                  38                      35
62           63  Female   67                  47                      52
67           68  Female   68                  48                      48
90           91  Female   68                  59                      55
106         107  Female   66                  63                      50
116         117  Female   63                  65                      43

In [51]:
print(csv_data.describe())

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [52]:
print(csv_data.describe(include="all"))

        CustomerID   Genre         Age  Annual Income (k$)  \
count   200.000000     200  200.000000          200.000000
unique         NaN       2         NaN                 NaN
top            NaN  Female         NaN                 NaN
freq           NaN     112         NaN                 NaN
mean    100.500000     NaN   38.850000           60.560000
std      57.879185     NaN   13.969007           26.264721
min       1.000000     NaN   18.000000           15.000000
25%      50.750000     NaN   28.750000           41.500000
50%     100.500000     NaN   36.000000           61.500000
75%     150.250000     NaN   49.000000           78.000000
max     200.000000     NaN   70.000000          137.000000

        Spending Score (1-100)
count               200.000000
unique                     NaN
top                        NaN
freq                       NaN
mean                 50.200000
std                  25.823522
min                   1.000000
25%                  34.750000
50%                  50.000000
75%                  73.000000
max                  99.000000

In [53]:
csv_data.describe(include=[np.number])

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [54]:
print(csv_data.describe(exclude=["O"]))

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [55]:
csv_data.isnull()

     CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0         False  False  False               False                   False
1         False  False  False               False                   False
2         False  False  False               False                   False
3         False  False  False               False                   False
4         False  False  False               False                   False
..          ...    ...    ...                 ...                     ...
195       False  False  False               False                   False
196       False  False  False               False                   False
197       False  False  False               False                   False
198       False  False  False               False                   False
199       False  False  False               False                   False

[200 rows x 5 columns]

In [56]:
csv_data.isna()

     CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0         False  False  False               False                   False
1         False  False  False               False                   False
2         False  False  False               False                   False
3         False  False  False               False                   False
4         False  False  False               False                   False
..          ...    ...    ...                 ...                     ...
195       False  False  False               False                   False
196       False  False  False               False                   False
197       False  False  False               False                   False
198       False  False  False               False                   False
199       False  False  False               False                   False

[200 rows x 5 columns]

In [57]:
data_missing = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data_missingvalue.csv")

In [58]:
print(data_missing.isnull().values.any())

True

In [59]:
data_missing.dropna()

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
3             4  Female  23.0                16.0                    77.0
6             7  Female  35.0                18.0                     6.0
7             8  Female  23.0                18.0                    94.0
9            10  Female  30.0                19.0                    72.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                    83.0

[195 rows x 5 columns]

In [60]:
data_missing.dropna()

     CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
3             4  Female  23.0                16.0                    77.0
6             7  Female  35.0                18.0                     6.0
7             8  Female  23.0                18.0                    94.0
9            10  Female  30.0                19.0                    72.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                    83.0

[195 rows x 5 columns]

In [61]:
print(data_missing.isnull().values.any())

True

In [62]:
data_missing=data_missing.dropna()

In [63]:
print(data_missing.isnull().values.any())

False

In [66]:
csv_data= csv_data.drop("Genre", axis=1)
print(csv_data)

     CustomerID  Age  Annual Income (k$)  Spending Score (1-100)
0             1   19                  15                      39
1             2   21                  15                      81
2             3   20                  16                       6
3             4   23                  16                      77
4             5   31                  17                      40
..          ...  ...                 ...                     ...
195         196   35                 120                      79
196         197   45                 126                      28
197         198   32                 126                      74
198         199   32                 137                      18
199         200   30                 137                      83

[200 rows x 4 columns]

In [67]:
csv_data.mean()

CustomerID                100.50
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [68]:
csv_data.median()

CustomerID                100.5
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [69]:
data_filling=data_missing.fillna(csv_data.mean())
print(data_filling.head(10))

    CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male  19.0                15.0                    39.0
3            4  Female  23.0                16.0                    77.0
6            7  Female  35.0                18.0                     6.0
7            8  Female  23.0                18.0                    94.0
9           10  Female  30.0                19.0                    72.0
10          11    Male  67.0                19.0                    14.0
11          12  Female  35.0                19.0                    99.0
12          13  Female  58.0                20.0                    15.0
13          14  Female  24.0                20.0                    77.0
14          15    Male  37.0                20.0                    13.0

In [70]:
data_filling=data_missing.fillna(csv_data.median())
print(data_filling.head(10))

    CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male  19.0                15.0                    39.0
3            4  Female  23.0                16.0                    77.0
6            7  Female  35.0                18.0                     6.0
7            8  Female  23.0                18.0                    94.0
9           10  Female  30.0                19.0                    72.0
10          11    Male  67.0                19.0                    14.0
11          12  Female  35.0                19.0                    99.0
12          13  Female  58.0                20.0                    15.0
13          14  Female  24.0                20.0                    77.0
14          15    Male  37.0                20.0                    13.0

In [71]:
csv_data['Annual Income (k$)'].astype('float')

0       15.0
1       15.0
2       16.0
3       16.0
4       17.0
       ...
195    120.0
196    126.0
197    126.0
198    137.0
199    137.0
Name: Annual Income (k$), Length: 200, dtype: float64

In [72]:
csv_data.dtypes

CustomerID                int64
Age                       int64
Annual Income (k$)        int64
Spending Score (1-100)    int64
dtype: object

In [73]:
csv_data['Annual Income (k$)'] = csv_data['Annual Income (k$)'].astype('float')
csv_data.dtypes

CustomerID                  int64
Age                         int64
Annual Income (k$)        float64
Spending Score (1-100)      int64
dtype: object

In [75]:
data_missing_drop = data_missing.dropna()

In [76]:
data_missing.dtypes

CustomerID                  int64
Genre                      object
Age                       float64
Annual Income (k$)        float64
Spending Score (1-100)    float64
dtype: object

In [77]:
data_missing.isnull().any().any()

False

In [78]:
data_missing.fillna(method="ffill", inplace=True)

In [79]:
data_missing.fillna(method="bfill", inplace=True)

In [80]:
data_missing.isnull().any().any()

False

In [81]:
data_missing.head(10)

    CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male  19.0                15.0                    39.0
3            4  Female  23.0                16.0                    77.0
6            7  Female  35.0                18.0                     6.0
7            8  Female  23.0                18.0                    94.0
9           10  Female  30.0                19.0                    72.0
10          11    Male  67.0                19.0                    14.0
11          12  Female  35.0                19.0                    99.0
12          13  Female  58.0                20.0                    15.0
13          14  Female  24.0                20.0                    77.0
14          15    Male  37.0                20.0                    13.0

In [83]:
data_missing.shape

(195, 5)